Revit 2027 API
ConduitSizeIterator.GetCurrent Method
 Returns the current ConduitSize.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConduitSize GetCurrent()
Public Function GetCurrent As ConduitSize
public:
ConduitSize^ GetCurrent()
member GetCurrent : unit -> ConduitSize
Return Value
ConduitSize
 The current ConduitSize.
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
See Also
Reference
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace